import 'package:flutter/material.dart';

class AppStrings {
  AppStrings._();

  static const appName = "تأمينك الطبي";
  static const medicalInsurance = "تكاليف العيادة الخارجية غير محددة بمبلغ معين (مفتوحة) حسب مبلغ ومدى التغطية في الوثيقة \n شبكة واسعة من المستشفيات والمستوصفات \n  الأمراض المزمنة والحالات السابقة للتأمين مغطاة بنسبة محددة من مدى التغطية \n الموافقات الطبية تصل المستشفيات فى اقصر وقت ممكن \n تغطية الاطفال حديثى الولادة مباشرة بعد الولادة \n الاهتمام بالمرضى والتأكد من مستوى الرعاية الطبية باستمرار";
  static const medicalServices = "يجب أن يكون لكل شخص مكفول بطاقة دخول شخصية صادرة عن الشركة لتسهيل وصوله إلى نوع الخدمات الطبية التابعة للشبكة الطبية ، والتي تستلزم دفع كل من تكاليف علاجه المغطاة باستثناء المبلغ المقتطع ";
  static const exceptions = "محاولة الإنتحار والإصابات الجسدية المتعمدة . وإرتكاب أو محاولة إرتكاب أي عمل غير مشروع وجميع الحالات المرتبطة بإدمان الكحول أو إستخدام العقاقير أو المواد المسببة للهلوسة\n حالات الإضطراب النفسي والعقلي بما فيها التخلف العقلي \n العاهات الخلقية والأمراض الخلقية و/أو التشوهات \n جميع الحالات الناجمة عن حرب، أعمال شغب، حروب أهلية  ";
  static const payBack1 = "إذا اختار المتكافل العلاج عند مقدم خدمات طبية غير تابع للشبكة الطبية ، او لم يقدم بطاقة دخوله الشخصية إلي مقدم الخدمات التابع للشبكة ،أو فضل الاستفادة من الدخول المجاني عند مقدم خدمات تابع للشبكة ،فانه يحق له المطالبة باسترداد نسبة من المبلغ وفقا لقيمة العلاج خارج الشبكة الطبية مع مراعاة الضوابط الخاصة بالاسترداد";
}
